import React from "react";

const HomePage = () => {
  return (
    <div className="transparent-box">
     <p style={{ fontSize: "1.1rem", lineHeight: "1.8", textAlign: "center", marginBottom: "20px" }}>
  👋 مرحبًا بك في <strong>منصة الخروبي للتدارك</strong>، الفضاء الرقمي المصمم خصيصًا لدعم تلاميذ باكالوريا اقتصاد في رحلتهم الدراسية.  
  هنا نعيد ترتيب المفاهيم، نراجع الدروس بطريقة منهجية، ونوفر محتوىً موجهًا يعزز الفهم ويقوّي الثقة في الذات.
</p>
<p style={{ fontSize: "1.1rem", color: "rgba(255, 255, 255, 1)" }}>
  📊 سواء كنت تسعى لفهم النظريات الاقتصادية أو تحسين مهاراتك في المحاسبة والإحصاء، هذه المنصة صممت لتكون لك سندًا في كل خطوة.  
  ✅ متابعة دقيقة، أدوات تعليمية متطورة، وبيئة محفزة نحو النجاح—مرحبا بك في رحلتك نحو التميّز!
</p>

    </div>
  );
};

export default HomePage;
